MikroElektronika/core_packages/PIC/XC8/def/PIC18F27K42/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x3994);
#ifndef _LIB_BUILD
asm("PIE4 equ 03994h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned TMR2IE                 :1;
        unsigned CCP1IE                 :1;
        unsigned                        :1;
        unsigned NCO1IE                 :1;
        unsigned CWG1IE                 :1;
        unsigned CLC1IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x3994);
// bitfield macros
#define _PIE4_TMR1IE_POSN                                   0x0
#define _PIE4_TMR1IE_POSITION                               0x0
#define _PIE4_TMR1IE_SIZE                                   0x1
#define _PIE4_TMR1IE_LENGTH                                 0x1
#define _PIE4_TMR1IE_MASK                                   0x1
#define _PIE4_TMR1GIE_POSN                                  0x1
#define _PIE4_TMR1GIE_POSITION                              0x1
#define _PIE4_TMR1GIE_SIZE                                  0x1
#define _PIE4_TMR1GIE_LENGTH                                0x1
#define _PIE4_TMR1GIE_MASK                                  0x2
#define _PIE4_TMR2IE_POSN                                   0x2
#define _PIE4_TMR2IE_POSITION                               0x2
#define _PIE4_TMR2IE_SIZE                                   0x1
#define _PIE4_TMR2IE_LENGTH                                 0x1
#define _PIE4_TMR2IE_MASK                                   0x4
#define _PIE4_CCP1IE_POSN                                   0x3
#define _PIE4_CCP1IE_POSITION                               0x3
#define _PIE4_CCP1IE_SIZE                                   0x1
#define _PIE4_CCP1IE_LENGTH                                 0x1
#define _PIE4_CCP1IE_MASK                                   0x8
#define _PIE4_NCO1IE_POSN                                   0x5
#define _PIE4_NCO1IE_POSITION                               0x5
#define _PIE4_NCO1IE_SIZE                                   0x1
#define _PIE4_NCO1IE_LENGTH                                 0x1
#define _PIE4_NCO1IE_MASK                                   0x20
#define _PIE4_CWG1IE_POSN                                   0x6
#define _PIE4_CWG1IE_POSITION                               0x6
#define _PIE4_CWG1IE_SIZE                                   0x1
#define _PIE4_CWG1IE_LENGTH                                 0x1
#define _PIE4_CWG1IE_MASK                                   0x40
#define _PIE4_CLC1IE_POSN                                   0x7
#define _PIE4_CLC1IE_POSITION                               0x7
#define _PIE4_CLC1IE_SIZE                                   0x1
#define _PIE4_CLC1IE_LENGTH                                 0x1
#define _PIE4_CLC1IE_MASK                                   0x80

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x3995);
#ifndef _LIB_BUILD
asm("PIE5 equ 03995h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IE                 :1;
        unsigned C2IE                   :1;
        unsigned DMA2SCNTIE             :1;
        unsigned DMA2DCNTIE             :1;
        unsigned DMA2ORIE               :1;
        unsigned DMA2AIE                :1;
        unsigned I2C2RXIE               :1;
        unsigned I2C2TXIE               :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x3995);
// bitfield macros
#define _PIE5_INT1IE_POSN                                   0x0
#define _PIE5_INT1IE_POSITION                               0x0
#define _PIE5_INT1IE_SIZE                                   0x1
#define _PIE5_INT1IE_LENGTH                                 0x1
#define _PIE5_INT1IE_MASK                                   0x1
#define _PIE5_C2IE_POSN                                     0x1
#define _PIE5_C2IE_POSITION                                 0x1
#define _PIE5_C2IE_SIZE                                     0x1
#define _PIE5_C2IE_LENGTH                                   0x1
#define _PIE5_C2IE_MASK                                     0x2
#define _PIE5_DMA2SCNTIE_POSN                               0x2
#define _PIE5_DMA2SCNTIE_POSITION                           0x2
#define _PIE5_DMA2SCNTIE_SIZE                               0x1
#define _PIE5_DMA2SCNTIE_LENGTH                             0x1
#define _PIE5_DMA2SCNTIE_MASK                               0x4
#define _PIE5_DMA2DCNTIE_POSN                               0x3
#define _PIE5_DMA2DCNTIE_POSITION                           0x3
#define _PIE5_DMA2DCNTIE_SIZE                               0x1
#define _PIE5_DMA2DCNTIE_LENGTH                             0x1
#define _PIE5_DMA2DCNTIE_MASK                               0x8
#define _PIE5_DMA2ORIE_POSN                                 0x4
#define _PIE5_DMA2ORIE_POSITION                             0x4
#define _PIE5_DMA2ORIE_SIZE                                 0x1
#define _PIE5_DMA2ORIE_LENGTH                               0x1
#define _PIE5_DMA2ORIE_MASK                                 0x10
#define _PIE5_DMA2AIE_POSN                                  0x5
#define _PIE5_DMA2AIE_POSITION                              0x5
#define _PIE5_DMA2AIE_SIZE                                  0x1
#define _PIE5_DMA2AIE_LENGTH                                0x1
#define _PIE5_DMA2AIE_MASK                                  0x20
#define _PIE5_I2C2RXIE_POSN                                 0x6
#define _PIE5_I2C2RXIE_POSITION                             0x6
#define _PIE5_I2C2RXIE_SIZE                                 0x1
#define _PIE5_I2C2RXIE_LENGTH                               0x1
#define _PIE5_I2C2RXIE_MASK                                 0x40
#define _PIE5_I2C2TXIE_POSN                                 0x7
#define _PIE5_I2C2TXIE_POSITION                             0x7
#define _PIE5_I2C2TXIE_SIZE                                 0x1
#define _PIE5_I2C2TXIE_LENGTH                               0x1
#define _PIE5_I2C2TXIE_MASK                                 0x80

